"""
- 了解python中常见的运算符
① 算数（数学）1.2.7 运算符
② 赋值运算符
"""

# 数学运算符
# +（加）
# 示例：两个对象相加a+b输出结果30
print("1 + 1=", 1 + 1)

# -（减）
# 示例：得到负数或是一个数减去另一个数a-b 输出结果结果-10
print("1 - 1=", 1 - 1)

# *（乘）
# 示例：两个数相乘或是返回一个被重复若干次的字符串a*b输出结果200
print("1 * 1=", 1 * 1)

# /（除）
# 示例：b/a输出结果2
print("4 / 2=", 4 / 2)

# //（取整数）
# 示例：返回商的整数部分9//2 输出结果为4，9.0//2.0输出结果为4.0
print("11 // 2=", 11 // 2)

# %（取余）
# 示例：返回除法的余数b%a 输出结果0
print("4 % 3=", 4 % 3)

# **（指数）
# 示例：a**b为10的20次方，输出结果100000000000000000000
print("2 ** 4=", 2 ** 4)

"""
- 赋值运算符

- =（赋值运算符）
把 = 号右边的结果赋给左边的变量，如num=1+2*3，结果num的值为7

- 复合赋值运算符

- +=（加法赋值运算符）
c+=a等效于c=c+a

- -=（减法赋值运算符）
c-=a等效于c=c-a

- *=（乘法赋值运算符）
c*=a等效于c=c*a

- /=（除法赋值运算符）
c/=a等效于c=c/a

- %=（取余赋值运算符）
c%=a等效于c=c%a

- **=（幂赋值运算符）
c**=a等效于c=c**a

- //=（整数赋值运算符）
c//=a等效于c=c//a
"""

num = 1
num += 1 # num = num + 1 （加法赋值运算符）
print("num += 1: ", num)

num -= 1 # num = num - 1 （减法赋值运算符）
print("num -= 1: ", num)

num *= 4 # num = num * 4 （乘法赋值运算符）
print("num *= 4: ", num)

num /= 2 # num = num / 2（除法赋值运算符）
print("num /= 2: ", num)

num = 4

num %= 3 # num = num % 3（取余赋值运算符）
print("num % 3: ", num)

num **= 3 # num = num ** 3（幂赋值运算符）
print("num ** 3: ", num)

num //= 2 # num = num // 2（整数赋值运算符）
print("num // 2: ", num)



