"""
- 目标
1. 完成文件备份案例
"""

"""
- 需求分析
需求：有一份账单文件，记录了消费收入的具体记录，内容如下：
name,date,money,type,remarks
周杰轮,2022-01-01,100000,消费,正式
周杰轮,2022-01-02,300000,收入,正式
周杰轮,2022-01-03,100000,消费,测试
林俊节,2022-01-01,300000,收入,正式
林俊节,2022-01-02,100000,消费,测试
林俊节,2022-01-03,100000,消费,正式
林俊节,2022-01-04,100000,消费,测试
林俊节,2022-01-05,500000,收入,正式
张学油,2022-01-01,100000,消费,正式
张学油,2022-01-02,500000,收入,正式
张学油,2022-01-03,900000,收入,测试
王力鸿,2022-01-01,500000,消费,正式
王力鸿,2022-01-02,300000,消费,测试
王力鸿,2022-01-03,950000,收入,正式
刘德滑,2022-01-01,300000,消费,测试
刘德滑,2022-01-02,100000,消费,正式
刘德滑,2022-01-03,300000,消费,正式

- 我们现在要做的是：
· 读取文件
· 将文件写出到bill.txt.bak文件作为备份
· 同时，将文件内标记为测试的数据行丢弃
"""
# 写入文件
fw = open(r"E:\python练习\python学习\第8章 文件操作\1.8.6 文件操作的综合案例\bill.txt", "w", encoding="utf-8")
fw.write("name,date,money,type,remarks"
        "\n周杰轮,2022-01-02,300000,收入,正式"
        "\n周杰轮,2022-01-03,100000,消费,测试"
        "\n林俊节,2022-01-01,300000,收入,正式"
        "\n林俊节,2022-01-02,100000,消费,测试"
        "\n林俊节,2022-01-03,100000,消费,正式"
        "\n林俊节,2022-01-04,100000,消费,测试"
        "\n林俊节,2022-01-05,500000,收入,正式"
        "\n张学油,2022-01-01,100000,消费,正式"
        "\n张学油,2022-01-02,500000,收入,正式"
        "\n张学油,2022-01-03,900000,收入,测试"
        "\n王力鸿,2022-01-01,500000,消费,正式"
        "\n王力鸿,2022-01-02,300000,消费,测试"
        "\n王力鸿,2022-01-03,950000,收入,正式"
        "\n刘德滑,2022-01-01,300000,消费,测试"
        "\n刘德滑,2022-01-02,100000,消费,正式"
        "\n刘德滑,2022-01-03,300000,消费,正式")
# 刷新文件，将内容存储到硬盘
fw.flush()
# 读取文件
fr = open(r"E:\python练习\python学习\第8章 文件操作\1.8.6 文件操作的综合案例\bill.txt", "r", encoding="utf-8")
fw_2 = open(r"E:\python练习\python学习\第8章 文件操作\1.8.6 文件操作的综合案例\bill.txt.bak", "w", encoding="utf-8")
# 判断是否为测试行
for line in fr:
    line = line.strip()
    if line.split(",")[4] == "测试":
        continue
    else:
        fw_2.write(line)
        fw_2.write("\n")
# 关闭文件
fw.close()
fw_2.close()
fr.close()







