"""
- 升职加薪
有如下员工信息，请使用字典完成数据的记录
并通过for循环，对所有级别为1级的员工，级别上升1级，薪水增加1000元

姓名    部门    工资    级别
小王    设计部   5000   1
味精    市场部   5000   2
楠楠    直播部   7000   3
小张    开发部   4000   4
光耀    大客户   9000   3
"""
# 定义字典
employee_dict = {"小王": {
                    "部门": "设计部",
                    "工资": 5000,
                    "级别": 1
                 },
                 "味精": {
                    "部门": "市场部",
                    "工资": 5000,
                    "级别": 2
                 },
                 "楠楠": {
                    "部门": "直播部",
                    "工资": 7000,
                    "级别": 3
                 },
                 "小张": {
                    "部门": "开发部",
                    "工资": 4000,
                    "级别": 4
                 },
                 "光耀": {
                    "部门": "大客户",
                    "工资": 9000,
                    "级别": 3
                 }
}
# 输出字典
print(f"全体员工当前信息如下：{employee_dict}")
# 通过for循环遍历字典
for name in employee_dict:
    # if条件判断符合条件的员工
    if employee_dict[name]["级别"] == 1:
        # 升值加薪操作
        employee_dict[name]["级别"] += 1
        employee_dict[name]["工资"] += 1000

print(f"全体员工级别为1的员工完成升职加薪操作后，结果是：{employee_dict}")



